blog-posts/2004-02-14-bookmarking.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Bookmarking</title>
<!-- 2015-01-07 Wed 14:57 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Bookmarking</h1>
<p>
February 14th, 2004 -
<a href="http://sachachua.com/blog/p/1707"><a href="http://sachachua.com/blog/p/1707">http://sachachua.com/blog/p/1707</a></a>
</p>

<pre class="example">
forcer: If I run across an interesting URL, I file it right away with some context clues.
forcer: If I need to refer to it again, I use a small elisp function that searches my notes.
forcer: It's a bit more context-sensitive than bookmarks, and it allows me to share the data with other people.
ah
forcer: If I feel diligent, I put it into my BBDB. Then I can hippie-expand from it in my mail and in chat.
forcer: For example, tldpM-/ is
so to say, you have a list of URLs and associated text :)
forcer: The Linux Documentation Project (http://www.tldp.org) is an excellent resource for newbies and
        experienced users alike. Check out its HOWTOs and guides for tons of information. There's a Linux Cookbook in
        there too, I think...
:)
forcer: Not really. I have random blog notes which occasionally have URLs. I can search on that and on the text
        around it.
forcer: I can also figure out when I visited a site...
ah
forcer: ... and since planner.el captures all sorts of annotations, I can usually even tell you how I found out
        about the page - it gets linked to an e-mail or to another planner page...
forcer: The e-mail links take me directly to the article, if it hasn't been expired yet.
forcer: If not, well, it's a message ID and it has the author's name, so I guess I can just search. 
forcer: Pretty useful system, a bit more flexible than bookmarks (at least for me.)
</pre>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
